# LAB: String Patterns, Sorting & Grouping

In [1]:
%load_ext sql

In [11]:
%sql sqlite://

'Connected: @None'

## Create 4 tables

In [32]:
%%sql

CREATE TABLE EMPLOYEES (
                            EMP_ID CHAR(9) NOT NULL, 
                            F_NAME VARCHAR(15) NOT NULL,
                            L_NAME VARCHAR(15) NOT NULL,
                            SSN CHAR(9),
                            B_DATE DATE,
                            SEX CHAR,
                            ADDRESS VARCHAR(30),
                            JOB_ID CHAR(9),
                            SALARY DECIMAL(10,2),
                            MANAGER_ID CHAR(9),
                            DEP_ID CHAR(9) NOT NULL,
                            PRIMARY KEY (EMP_ID));

 * sqlite://
(sqlite3.OperationalError) table EMPLOYEES already exists [SQL: 'CREATE TABLE EMPLOYEES (\n                            EMP_ID CHAR(9) NOT NULL, \n                            F_NAME VARCHAR(15) NOT NULL,\n                            L_NAME VARCHAR(15) NOT NULL,\n                            SSN CHAR(9),\n                            B_DATE DATE,\n                            SEX CHAR,\n                            ADDRESS VARCHAR(30),\n                            JOB_ID CHAR(9),\n                            SALARY DECIMAL(10,2),\n                            MANAGER_ID CHAR(9),\n                            DEP_ID CHAR(9) NOT NULL,\n                            PRIMARY KEY (EMP_ID));'] (Background on this error at: http://sqlalche.me/e/e3q8)

In [13]:
%%sql

CREATE TABLE JOB_HISTORY (
                            EMPL_ID CHAR(9) NOT NULL, 
                            START_DATE DATE,
                            JOBS_ID CHAR(9) NOT NULL,
                            DEPT_ID CHAR(9),
                            PRIMARY KEY (EMPL_ID,JOBS_ID));

 * sqlite://
Done.

[]

In [14]:
%%sql

CREATE TABLE JOBS (
                            JOB_IDENT CHAR(9) NOT NULL, 
                            JOB_TITLE VARCHAR(15) ,
                            MIN_SALARY DECIMAL(10,2),
                            MAX_SALARY DECIMAL(10,2),
                            PRIMARY KEY (JOB_IDENT));

 * sqlite://
Done.

[]

In [33]:
%%sql 

CREATE TABLE DEPARTMENTS (
                            DEPT_ID_DEP CHAR(9) NOT NULL, 
                            DEP_NAME VARCHAR(15) ,
                            MANAGER_ID CHAR(9),
                            LOC_ID CHAR(9),
                            PRIMARY KEY (DEPT_ID_DEP));

 * sqlite://
(sqlite3.OperationalError) table DEPARTMENTS already exists [SQL: 'CREATE TABLE DEPARTMENTS (\n                            DEPT_ID_DEP CHAR(9) NOT NULL, \n                            DEP_NAME VARCHAR(15) ,\n                            MANAGER_ID CHAR(9),\n                            LOC_ID CHAR(9),\n                            PRIMARY KEY (DEPT_ID_DEP));'] (Background on this error at: http://sqlalche.me/e/e3q8)

In [16]:
%%sql

CREATE TABLE LOCATIONS (
                            LOCT_ID CHAR(9) NOT NULL,
                            DEP_ID_LOC CHAR(9) NOT NULL,
                            PRIMARY KEY (LOCT_ID,DEP_ID_LOC));

 * sqlite://
Done.

[]

## Insert data into tables

In [20]:
%%sql

insert into EMPLOYEES
(EMP_ID, F_NAME, L_NAME, SSN, B_DATE, SEX, ADDRESS, JOB_ID, SALARY, MANAGER_ID, DEP_ID)
VALUES
('E1001','John', 'Thomas','123456','01/09/1976','M','"5631 Rice, OakPark,IL"','100','100000','30001','2')

 * sqlite://
1 rows affected.

[]

In [21]:
%%sql
select * from EMPLOYEES

 * sqlite://
Done.

[('E1001', 'John', 'Thomas', '123456', '01/09/1976', 'M', '"5631 Rice, OakPark,IL"', '100', 100000, '30001', '2')]

In [24]:
%%sql

update EMPLOYEES
SET ADDRESS = "5631 Rice, OakPark,IL"
where F_NAME = 'John'

 * sqlite://
1 rows affected.

[]

In [27]:
%%sql

Select * from Employees

 * sqlite://
Done.

[('E1001', 'John', 'Thomas', '123456', '01/09/1976', 'M', '5631 Rice, OakPark,IL', '100', 100000, '30001', '2')]

### Let's insert the rest of the data

In [28]:
%%sql

insert into EMPLOYEES
(EMP_ID, F_NAME, L_NAME, SSN, B_DATE, SEX, ADDRESS, JOB_ID, SALARY, MANAGER_ID, DEP_ID)
VALUES
('E1002','Alice','James','123457','07/31/1972','F',"980 Berry ln, Elgin,IL",'200','80000','30002','5'),
('E1003','Steve','Wells','123458','08/10/1980','M',"291 Springs, Gary,IL",'300','50000','30002','5'),
('E1004','Santosh','Kumar','123459','07/20/1985','M',"511 Aurora Av, Aurora,IL",'400','60000','30004','5'),
('E1005','Ahmed','Hussain','123410','01/04/1981','M',"216 Oak Tree, Geneva,IL",'500','70000','30001','2'),
('E1006','Nancy','Allen','123411','02/06/1978','F',"111 Green Pl, Elgin,IL",'600','90000','30001','2'),
('E1007','Mary','Thomas','123412','05/05/1975','F',"100 Rose Pl, Gary,IL",'650','65000','30003','7'),
('E1008','Bharath','Gupta','123413','05/06/1985','M',"145 Berry Ln, Naperville,IL",'660','65000','30003','7'),
('E1009','Andrea','Jones','123414','07/09/1990','F',"120 Fall Creek, Gary,IL",'234','70000','30003','7'),
('E1010','Ann','Jacob','123415','03/30/1982','F',"111 Britany Springs,Elgin,IL",'220','70000','30004','5')

 * sqlite://
9 rows affected.

[]

In [29]:
%%sql 

select * from EMPLOYEES

 * sqlite://
Done.

[('E1001', 'John', 'Thomas', '123456', '01/09/1976', 'M', '5631 Rice, OakPark,IL', '100', 100000, '30001', '2'),
 ('E1002', 'Alice', 'James', '123457', '07/31/1972', 'F', '980 Berry ln, Elgin,IL', '200', 80000, '30002', '5'),
 ('E1003', 'Steve', 'Wells', '123458', '08/10/1980', 'M', '291 Springs, Gary,IL', '300', 50000, '30002', '5'),
 ('E1004', 'Santosh', 'Kumar', '123459', '07/20/1985', 'M', '511 Aurora Av, Aurora,IL', '400', 60000, '30004', '5'),
 ('E1005', 'Ahmed', 'Hussain', '123410', '01/04/1981', 'M', '216 Oak Tree, Geneva,IL', '500', 70000, '30001', '2'),
 ('E1006', 'Nancy', 'Allen', '123411', '02/06/1978', 'F', '111 Green Pl, Elgin,IL', '600', 90000, '30001', '2'),
 ('E1007', 'Mary', 'Thomas', '123412', '05/05/1975', 'F', '100 Rose Pl, Gary,IL', '650', 65000, '30003', '7'),
 ('E1008', 'Bharath', 'Gupta', '123413', '05/06/1985', 'M', '145 Berry Ln, Naperville,IL', '660', 65000, '30003', '7'),
 ('E1009', 'Andrea', 'Jones', '123414', '07/09/1990', 'F', '120 Fall Creek, Gary,IL', '234', 70000, '30003', '7'),
 ('E1010', 'Ann', 'Jacob', '123415', '03/30/1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30004', '5')]

In [37]:
%%sql

insert into DEPARTMENTS
(DEPT_ID_DEP, DEP_NAME, MANAGER_ID, LOC_ID)
VALUES
('2','Architect Group','30001','L0001'),
('5','Software Group','30002','L0002'),
('7','Design Team','30003','L0003')

 * sqlite://
3 rows affected.

[]

## Questions:

### Retrieve all employees whose address is in Elgin,IL

In [42]:
%%sql

;
select F_NAME , L_NAME
from EMPLOYEES
where ADDRESS LIKE '%Elgin,IL%' ;

 * sqlite://
0 rows affected.
Done.

[('Alice', 'James'), ('Nancy', 'Allen'), ('Ann', 'Jacob')]

### Retrieve all employees who were born during the 1970's.

In [45]:
%%sql

;
select F_NAME , L_NAME
from EMPLOYEES
where B_DATE LIKE '%197%' ;

 * sqlite://
0 rows affected.
Done.

[('John', 'Thomas'),
 ('Alice', 'James'),
 ('Nancy', 'Allen'),
 ('Mary', 'Thomas')]

###  Retrieve all employees in department 5 whose salary is between 60000 and 70000

In [49]:
%%sql

;
select *
from EMPLOYEES
where SALARY BETWEEN 60000 and 70000 and DEP_ID = 5 ;

 * sqlite://
0 rows affected.
Done.

[('E1004', 'Santosh', 'Kumar', '123459', '07/20/1985', 'M', '511 Aurora Av, Aurora,IL', '400', 60000, '30004', '5'),
 ('E1010', 'Ann', 'Jacob', '123415', '03/30/1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30004', '5')]

###  Retrieve a list of employees ordered by department ID

In [50]:
%%sql

;
select F_NAME, L_NAME, DEP_ID 
from EMPLOYEES
order by DEP_ID;

 * sqlite://
0 rows affected.
Done.

[('John', 'Thomas', '2'),
 ('Ahmed', 'Hussain', '2'),
 ('Nancy', 'Allen', '2'),
 ('Alice', 'James', '5'),
 ('Steve', 'Wells', '5'),
 ('Santosh', 'Kumar', '5'),
 ('Ann', 'Jacob', '5'),
 ('Mary', 'Thomas', '7'),
 ('Bharath', 'Gupta', '7'),
 ('Andrea', 'Jones', '7')]

### Retrieve a list of employees ordered in descending order by department ID and within each department ordered alphabetically in descending order by last name.

In [52]:
%%sql

;
select F_NAME, L_NAME, DEP_ID 
from EMPLOYEES
order by DEP_ID desc, L_NAME desc;

 * sqlite://
0 rows affected.
Done.

[('Mary', 'Thomas', '7'),
 ('Andrea', 'Jones', '7'),
 ('Bharath', 'Gupta', '7'),
 ('Steve', 'Wells', '5'),
 ('Santosh', 'Kumar', '5'),
 ('Alice', 'James', '5'),
 ('Ann', 'Jacob', '5'),
 ('John', 'Thomas', '2'),
 ('Ahmed', 'Hussain', '2'),
 ('Nancy', 'Allen', '2')]

### For each department ID retrieve the number of employees in the department

In [58]:
%%sql

;
select DEP_ID, COUNT(*) 
from EMPLOYEES
group by DEP_ID;

 * sqlite://
0 rows affected.
Done.

[('2', 3), ('5', 4), ('7', 3)]

### For each department retrieve the number of employees in the department, and the average employees salary in the department.

In [57]:
%%sql

;
select DEP_ID, COUNT(*), AVG(SALARY)
from EMPLOYEES
group by DEP_ID;

 * sqlite://
0 rows affected.
Done.

[('2', 3, 86666.66666666667), ('5', 4, 65000.0), ('7', 3, 66666.66666666667)]

### Label the computed columns in the result set of last question as “NUM_EMPLOYEES” and “AVG_SALARY”.

In [62]:
%%sql

;
select DEP_ID, COUNT(*) AS "NUM_EMPLOYEES", AVG(SALARY) AS "AVG_SALARY"
from EMPLOYEES
group by DEP_ID;

 * sqlite://
0 rows affected.
Done.

[('2', 3, 86666.66666666667), ('5', 4, 65000.0), ('7', 3, 66666.66666666667)]

###  In the last question order the result set by Average Salary.

In [60]:
%%sql

;
select DEP_ID, COUNT(*) AS "NUM_EMPLOYEES", AVG(SALARY) AS "AVG_SALARY"
from EMPLOYEES
group by DEP_ID
order by AVG_SALARY;

 * sqlite://
0 rows affected.
Done.

[('5', 4, 65000.0), ('7', 3, 66666.66666666667), ('2', 3, 86666.66666666667)]

 ### In the last question limit the result to departments with fewer than 4 employees.

In [63]:
%%sql

;
select DEP_ID, COUNT(*) AS "NUM_EMPLOYEES", AVG(SALARY) AS "AVG_SALARY"
from EMPLOYEES
group by DEP_ID
having count(*) < 4
order by AVG_SALARY;

 * sqlite://
0 rows affected.
Done.

[('7', 3, 66666.66666666667), ('2', 3, 86666.66666666667)]

### if you want to use the label

In [64]:
%%sql

;
select DEP_ID, NUM_EMPLOYEES, AVG_SALARY from
  ( select DEP_ID, COUNT(*) AS NUM_EMPLOYEES, AVG(SALARY) AS AVG_SALARY from EMPLOYEES group by DEP_ID)
  where NUM_EMPLOYEES < 4
order by AVG_SALARY;

 * sqlite://
0 rows affected.
Done.

[('7', 3, 66666.66666666667), ('2', 3, 86666.66666666667)]

### Retrieve a list of employees ordered by department name, and within each department ordered alphabetically in descending order by last name.
_Obs: Department name is in the DEPARTMENTS table. So your query will need to
retrieve data from more than one table_

In [65]:
%%sql

;
select D.DEP_NAME , E.F_NAME, E.L_NAME
from EMPLOYEES as E, DEPARTMENTS as D
where E.DEP_ID = D.DEPT_ID_DEP
order by D.DEP_NAME, E.L_NAME desc ;

 * sqlite://
0 rows affected.
Done.

[('Architect Group', 'John', 'Thomas'),
 ('Architect Group', 'Ahmed', 'Hussain'),
 ('Architect Group', 'Nancy', 'Allen'),
 ('Design Team', 'Mary', 'Thomas'),
 ('Design Team', 'Andrea', 'Jones'),
 ('Design Team', 'Bharath', 'Gupta'),
 ('Software Group', 'Steve', 'Wells'),
 ('Software Group', 'Santosh', 'Kumar'),
 ('Software Group', 'Alice', 'James'),
 ('Software Group', 'Ann', 'Jacob')]